import {View} from "@tarojs/components";
import './index.scss'

const Index = () => {

  return (
    <View className='container wrapper'>
      <View className='h1'>MatchUs用户协议</View>
      <View className='p2'>更新时间: 2022年3月6日</View>
      <View className='p2 margin-bottom-48' >生效时间: 2022年3月6日</View>
      <View className='p1 margin-bottom-24'>欢迎您使用MatchUs平台小程序（以下简称“本平台”），本平台由杭州来夕网络科技有限公司为您提供服务。本协议是您与本平台以及杭州来夕网络科技有限公司（本平台以及杭州来夕网络科技有限公司以下合称“我们”）之间关于您成为本平台会员且使用我们提供的服务所订立的协议。</View>
      <View className='p1 bold'>请在接受我们服务之前审慎阅读本协议，您应重点阅读加粗字体显示的内容。特别是本协议含有免除或者限制责任的条款（该类条款通常含有“不负任何责任”、“无义务”等词汇），和其它限制会员权利的条款（该类条款通常含有“不得”等词汇）。</View>
      <View className='p1 bold margin-bottom-12'>除非您已阅读并接受本协议所有条款，否则您无权注册、登录或使用本协议所涉相关服务。无论您事实上是否在接受我们提供的服务之前认真阅读了本协议内容，您的注册、登录、使用等行为即视为对本协议各项条款的约束的接受，届时您不应以未阅读或接受本协议为由，主张本协议无效或要求撤销本协议。</View>
      <View className='p1 margin-bottom-12'>本协议约定我们与您之间关于“MatchUs”（包括但不限于MatchUs小程序、公众号等）所有的服务的权利义务、资料及信息，同时适用于本平台和您之间通过各种方式（包括但不限于电子邮件、电话或传真等）进行的任何沟通。
        为免歧义，除非本协议中另有说明或根据本协议上下文理解另有含义，本协议中的“用户”是指“注册”、“登录”或“使用”（指您注册成为本平台会员并使用我们提供的任何服务）本服务的个人或者未注册成为本平台会员，但通过阅读、浏览、复制或以其他任何方式使用我们提供的任何信息以及以任何方式使用我们提供各类服务的个人。
      </View>
      <View className='p1 bold margin-bottom-24'>您接受本协议后即受全部条款的约束，包括接受我们对任一服务条款随时所作的任何修改。本协议可由本平台随时更新，更新后的协议条款一旦以任何形式公布即代替原协议条款，即刻自动生效，协议更新以本平台通知为准，不再另行通知。您可以查阅最新版协议条款，查询路径：MatchUs小程序-我的-设置-关于我们。在本平台修改本协议后，如果用户不接受修改后的条款，请立即停止使用本平台提供的服务。用户继续使用本平台提供的服务，即被视为已接受已经修改后的协议。</View>

      <View className='h2 margin-bottom-12 purple'>特别声明</View>
      <View className='p1 margin-bottom-12'>•	鉴于： 《中华人民共和国民法典》第四百九十六条 格式条款是当事人为了重复使用而预先拟定，并在订立合同时未与对方明确协商的条款。
        •	采用格式条款订立合同的双方，提供格式条款的一方应当遵循公平原则，并确定当事人之间的权利和义务，同时采取合理的方式提示对方注意免除或者减轻其责任等与对方有重大利害关系的条款，按照对方的要求，对该条款予以解释说明。若提供格式条款的一方未履行提示或者说明义务，致使对方没有注意或者理解与其有重大利害关系的条款的，对方可以主张该条款不成为合同的内容。
        •	我们在此依法做出特别声明如下：
        •	我们采取合理的方式请您注意的义务将通过如下方式实现：在本协议中我们以明确足以引起您注意的加重字体、等合理方式提醒用户注意相关条款（需要强调的是，还包括用户应特别注意任何未明确标记的含有“不承担”、“免责”“不得”等形式用语的条款），该等条款的确认将导致您在特定情况下的被动、不便或损失，请您在确认同意本协议之前再次阅读上述条款。
        •	鉴于我们已依法明确了上述条款、履行了格式条款制订方的义务，您进行下一步，将被视为且应当被视为您已经完全注意并同意了本协议所有条款尤其是提醒会员注意的条款的合法性及有效性，用户不应当以我们未对格式条款以合理方式提醒用户注意，或未根据用户要求尽到说明义务为理由而声称或要求法院或其它任何第三方确认相关条款不成为合同的内容。
      </View>

      <View className='h2 margin-bottom-12'>•	1.服务和资格</View>
      <View className='p1 margin-bottom-24'>•	1.1 注册资格
        •	您必须年满18周岁才能注册成为本平台的会员或使用本平台。注册成为本平台之会员，表示您陈述并保证您已具备独立签订本协议，具备完全民事权利能力和完全民事行为能力的自然人。如果您未满18周岁，请马上停止使用本服务。本平台将依赖用户提供的个人信息判断用户是否为未成年人。
        •	您必须是具有中国国籍的单身人士才能注册成为本平台用户。为免歧义，此处“单身人士”系指尚未与他人缔结婚姻关系的任何具有中国国籍的公民，包括未婚、离异或是丧偶。在本平台提供服务过程中，如果您的恋爱以及婚姻状态发生变更，已经不符合本平台注册资格，请联系我们注销您的账号，否则由此产生的所有责任和费用均由您自行承担。
        •	您必须保证以恋爱或婚姻为目的使用本平台服务，向本平台提供真实、准确、最新及完整的个人资料。
        •	您必须是账号的实际拥有人，仅代表您自己接受本平台的各项服务。账号的所有权归本平台所有，用户完成申请注册手续后，获得账号的使用权，该使用权仅属于初始申请注册人，禁止赠与、借用、租用、转让或售卖否则由此给他人或本平台造成损失的，由您承担所有责任。如果本平台发现使用者并非账号初始注册人，有权在未经通知的情况下回收该账号而无需向该账号使用人承担法律责任，由此带来的包括并不限于用户通讯中断、用户资料和道具、会员权益等清空等损失由用户自行承担。
        •	用户在使用本服务前需要通过微信登录授权或手机号验证注册一个"MatchUs”账号。用户登录本平台以后，可以自行设置账号信息，包括但不限于用户的头像、照片、呢称、性别、出生日期、身高、专业、个人说明、兴越爱好、感情观、心仪的TA等信息。
        •	1.2 服务内容
        •	本平台的服务分为线上服务和线下服务。“线上服务”是指本平台上显示的全部功能及服务。“线下服务”将不时予以更新。
        •	关于会员付费的特别提示：针对本平台提供的付费服务项目，您必须成为本平台的付费会员，方能享受本平台提供的相应服务。有关当前收费服务内容及其价格说明，请在购买前仔细阅读服务说明页面。该服务说明页面上所载之内容构成本协议的一部分。除本平台另有说明外，所有付费业务均不支持退费。
        •	1.3 信息
        •	在满足第1.1条所述资格的情况下，您可以注册成为本平台的会员。本平台有权对您的提供的账号信息进行审查。要创建并维持会员账户， 您必须向我们提供准确、合法、有效的信息，包括但不限于身份证、学位证、工作信息、征信信息等，承诺以您合法有效的真实身份注册成为本平台的会员，并保证您所提供的个人身份资料信息真实、完整、有效，依据法律法规规定和本协议约定对您所提供的信息承担相应的法律责任。如果因此给本平台或第三方造成损害的，您应当依法予以赔偿。
        •	a.身份认证
        •	您授权我们（直接或通过第三方）进行我们认为验证您的身份所必须的任何时间的任何查询。为更好地满足您的服务要求，这包括要求您提供更多信息或文件。 如我们有合理理由怀疑您提供的资料错误、不实以及有其他违背法律法规和本平台的规定，我们有权通过您注册本平台时填写的微信号、手机号码等向您发出询问或通知的意思表示，在您知悉我们的意思表示之日起的3日内若未改正，并未做出任何解释或解释不足以说明您的问题，我们有权直接做出删除相应资料的处理，直至中止、终止对您提供部分或全部服务。我们对此不承担任何责任，您将承担一切法律责任以及一切费用。
        •	b.信息授权
        •	除非法律法规明确规定，任何您传输至本平台或在本平台上公布的资料都将视为非机密和非专有的。您的上述行为表明您已同意我们对公布及以其他方式合法使用该类资料将不承担任何责任。同时，您也授权我们和我们的人员有权在法律法规规定的限度内复制、披露、传播、整合或以其他方式使用该类资料中涉及的包括但不限于数据、图像、声音、文本以及其他内容等，以用作商业或非商业目的，并且您同意我们有权以上述方式无偿使用该类资料。
        •	鉴于“MatchUs”账号的绑定注册方式，您同意本平台在注册时将使用您提供的手机号码及/或自动提取您的手机号码及自动提取您的手机设备识别码等信息用于注册。
        •	c.信息查询和更新
        •	如果您所提供的个人身份资料信息发生变更，应当及时、有效地在本平台个人信息设置中同步更新，我们有权随时对您更新的信息真实性和合法性依据规定进行审核。若您所提供的资料与事实不符或之前所提供的资料事实上业已变更而未更新或有任何误导之嫌导致本平台无法为您进一步提供服务，我们不因此承担任何责任。
        •	d.账号安全
        •	用户有责任妥善保管注册账号信息及账号密码的安全，因用户保管不善可能导致遭受盗号或码失窃，责任由用户自行承担。用户需要对注册账号以及密码下的行为承担法律责任。用户同意在任何情况下不使用其他用户的账号或密码。在用户怀疑他人使用其账号或密码时，用户同意立即通知本平台。
        •	1.4 声明
        •	您必须是注册用户账号的实际拥有者，仅代表您自己接受我们的各项服务以及遵守本协议的规定。
        •	如用户注册账号后超过180天不登录，本平台可以收回该账号，以免造成资源浪费，由此造成的不利后果由用户自行承担。
        •	您可以联系人工客服提交注销申请。在您申请账号注销时，我们可能会要求您进行身份验证，以保障帐号的安全。本平台将在收到您的账号注销申请后15天内完成注销处理,如果您在15天内继续使用账号并撤销申请，我们可恢复您的账号信息。否则，您的账号将被正式注销，即对您的个人信息进行删除或匿名化处理,使其保持不可被检索、访问的状态。
      </View>

      <View className='h2 margin-bottom-12'>•	2.账号安全</View>
      <View className='p1 margin-bottom-24'>•	用户应当采取适当措施保障注册本平台账户过程中所指定用户名和密码的机密性，不应在您公开的用户档案中包含任何联系方式（包括但不限于姓氏、街道地址、电话号码、URL、电子邮件地址、即时聊天工具号码如微信，以及上述联系方式的任何变体）。并且您对以您的用户名和密码进行的所有活动承担全部责任。 您已同意：
        •	(a) 一经发现，将未经授权使用您的用户名或密码或其他侵犯帐户安全的任何行为立即通知本平台，并及时采取有效合法措施保护您的用户名或密码；
        •	(b) 确保您于使用结束后退出您的帐户；
        •	(c)本平台对因您未遵守上述规定而给您或他人带来的任何损失不承担责任。
        •	当您从公共或共享计算机上访问您的帐户时，应谨慎以保证其他人无法查看或记录您的密码或其他个人信息，您保证您承担高度的注意义务。如果您与其他人共享您的计算机，应将Microsoft.Net Passport或AOL ScreenName链接至您的本平台帐户，您应考虑禁用自动登录功能。
      </View>

      <View className='h2 margin-bottom-12'>•	3.会员服务使用规则</View>
      <View className='p1 margin-bottom-24'>•	3.1本服务的具体内容由本平台根据实际情况提供，包括但不限于授权用户通过其账号进行寻觅心仪的人、编辑资料、学历认证等。本平台可以对提供的服务予以变更，且本平台提供的服务内容可能随时变更，用户继续使用更新后服务时会收到版本更新通知。
        •	3.2为保护本平台所有用户之利益，以及保障本平台持续经营之目的，除经我们事先书面通知您并允许之外，您不得以任何方式在任何公共信息平台（包括但不限于任何网站、网页、微博、报纸、期刊、电视、电影等各种类型媒体）或在使用任何网络软件（包括但不限于QQ等即时通讯工具）的过程中将您在本产品的ID号码或昵称与您的任何联系方式一并予以公布。一旦本平台发现您存在上述行为，则我们有权独立作出判断并就此采取限制您的用户权限或取消您的用户资格等惩罚性措施，并且我们不承担任何责任。您承诺在使用本平台服务期间，严格遵守《中华人民共和国民法典》《中华人民共和国电信条例》《中华人民共和国保守国家秘密法》《中华人民共和国著作权法》《计算机信息网络国际联网安全保护管理办法》《互联网信息服务管理办法》等相关法律法规的规定。在任何情况下，如果本平台有任何理由认为用户或会员使用本平台服务过程中的任何行为，包括但不限于用户或会员的任何言论和其它行为违反或可能违反上述法律和法规的任何规定，本平台可在任何时候不经任何事先通知终止向该用户或会员提供服务。
        •	3.3为保护本平台所有用户之利益，以及保障本平台持续经营之目的，一旦我们发现您在本应用的ID或昵称和相应个人的联系方式被一并公布在任何其他公共信息平台（包括但不限于任何网站、网页、微博、报纸、期刊、电视、电影等各种类型的媒体）或被任何个人通过网络软件（包括但不限于QQ、MSN等即时通讯工具）所公布，无论该信息的公布是任何人所为，您在此同意完全授权我们，在您会员身份持续期间，就撤销上述公布之信息采取任何行动，在前述公布之信息得以撤销之前，我们有权以任何方式限制您在本平台的会员权利，无论该信息之公布是否是您所为。对于我们采取以上措施而给您带来的不便甚至损失，于缔结本协议时您已表示理解并同意完全免除我们因此给您造成的任何损失的赔偿责任。对于因您公布上述信息而给我们造成的损失，我们有权要求您予以赔偿。
        •	3.4 用户不得将本平台用作任何商业用途。本平台仅供用户为个人恋爱之所用，除非经我们书面授权，不得与任何商业行为相关联。任何法人或其他组织不能成为本平台之用户，并且任何人不应将本平台或本平台提供之任何信息及服务用作任何商业目的，任何非法或未经授权而使用本平台的行为，包括但不限于通过电子或其他方法，基于传送未经请求的电子邮件或未经授权的对于本平台的链接(Linking)或帧联(Framing)的目的，而收集用户的用户名或电子邮件地址等信息，都将受到我们的调查，同时我们将采取适当法律措施以保护我们的权益。
        •	3.5供成员用于非商业用途。对于本平台所提供的任何服务，您不得用于任何商业用途，但经本平台明确认可或批准的商业用途除外。禁止非法和未经授权使用MatchUs服务，我们可以在不经任何通知的情况下删除用户档案文件中的商业广告、关联链接和其他形式的推销内容，并且可以据此终止您的用户资格。对于任何非法或未经授权使用本服务的行为，我们将会立即采取适当的法律行动。
        •	3.6 提交信息真实性声明。您必须对您在本平台公布、提交、张贴或其他任何方式显示的任何内容，或您通过本平台提供之服务传输给其他会员的任何内容负全部责任。您申明并保证您在任何时候公布的内容是：(a)准确、真实、合法和非误导性的；(b)未违反本协议和相关法律法规的规定；(c)任何情况下不会侵犯任何第三方的权利和利益。
        •	3.7 禁止利用本平台或账号制作、上载、复制、发布、传播含有包括但不限于如下列法律法规和政策禁止的内容的信息（本条所述内容是指用户使用本服务过程中所制作、上载、复制、发布、传播的任何内容，包括但不限于账号头像、名称、个人信息、自我描述等注册信息及认证资料，或文字、语音、图片、视频、图文等发送、回复或自动回复消息和相关链接页面，以及其他使用账号或本服务所产生的内容）。
        •	a.反对宪法所确定的基本原则的；
        •	b.危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
        •	c.损害国家荣誉和利益的；
        •	d.煽动民族仇恨、民族歧视，破坏民族团结的；
        •	e.破坏国家宗教政策，宣扬邪教和封建迷信的；
        •	f.散布谣言，扰乱社会秩序，破坏社会稳定的；
        •	g.散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
        •	h.侮辱或者诽谤他人，侵害他人合法权益的；
        •	i. 不遵守法律法规底线、社会主义制度底线、国家利益底线、公民合法权益底线、社会公共秩序底线、道德风尚底线和信息真实性底线的“七条底线”要求的；
        •	j.含有法律、行政法规禁止的其他内容的。
        •	3.8 禁止利用本平台或本账号制作、复制、发布、传播如下干扰平台正常运营，以及侵犯其他用户或第三方合法权益的内容：
        •	a. 侵害他人名誉权、肖像权、知识产权、商业秘密等合法权利的，未经权利人允许，构建任何第三人的档案（包括但不限于涉及他人隐私、个人信息或资料的内容）或使用其照片并在本平台发布；
        •	b.骚扰或鼓动他人对其他人进行骚扰，包括但不限于含有任何性或性暗示的，含有辱骂、恐吓、威胁内容的；
        •	c.传播或参与传播“垃圾邮件”、“连锁信”或未经请求的大量邮件或“兜售信息”或骚扰、垃圾广告、恶意信息、诱骗信息；
        •	d.宣传您知道或应当知道的错误、误导性信息，或宣传违法活动；
        •	e.传播有关违法的、未经授权的受知识产权法律法规保护的作品副本，包括但不限于提供盗版计算机程序或这些程序的链接、提供如何规避制造商所安装之副本保护设备的信息、或提供盗版音乐或这些盗版音乐文件夹的链接；
        •	f. 从不满18周岁的人那里索取其个人信息或照片并在本平台发布；
        •	g.您不应删除本平台包含的任何他人拥有著作权、商标或其他知识产权、所有权等合法权益的信息；
        •	h.从其他会员处索取密码或个人标识信息，用作商业或非法目的；
        •	i.提供关于违法活动的指导性信息，如有关如何制造或购买非法武器、侵犯他人隐私、提供或制造计算机病毒的信息；
        •	j.未经我们事先书面许可，发布任何销售活动或任何其他商业活动之信息，如竞赛、赌博、交易、广告和金字塔计划等任何盈利性行为。
        •	k.通过本平台向其他用户发布有关推销或请求其购买或出售任何产品或服务的信息，或因商业目的发布邀请其他用户参加各类团体或社会活动或其他网络的信息。
        •	l.其他违反法律、法规明文规定以及公序良俗或者经我们单方面判断为不合适的信息。
        •	我们有权依据独立的判断对违反以上禁止性行为的任何人进行调查并采取适当的法律行动维权，包括但不限于：从本平台上删除侮辱性通信、冻结、终止该类侵犯者的用户身份等。如上述行为给我们造成损失，我们有权要求您承担一切责任。
        •	3.9 禁止利用本平台从事包括但不限于以下活动。如果您不合理使用本平台提供之服务，或利用本平台从事以下不恰当或不合法的行为，本平台有权冻结、终止您用户身份，保留向您采取任何及所有必要法律行动进行索赔的权利。若相关行为涉嫌犯罪的，本平台将依法移交司法部门处理。
        •	a. 提交、发布虚假信息，或盗用他人头像或资料，冒充、利用任何其他人或实体名义的；
        •	b.“跟踪”或以其他方式骚扰任何人；
        •	c.未经我们事先特定书面同意，明示或暗示本平台支持您所作的任何声明；
        •	d.未经该类拥有者事先同意，以任何方式张贴、散布或转载任何受保护的资料、商标或其他知识产权或所有权信息；
        •	e. 使用任何软件机器人（Robot/Spider）、站点搜索/检索应用程序，或其他手动或自动设备或程序来检索、索引、“数据挖掘”或以任何方式转载或规避“服务”或其内容的导航结构或表示法；
        •	f.删除本平台包含的任何他人拥有著作权、商标或其他知识产权、所有权等的信息；
        •	g.未经本平台事先书面授权，对本平台及本平台提供之任何服务释放到任何终端内存中的数据、运行过程中客户端与服务器端的交互数据，以及运行所必需的系统数据，进行“帧联（Framing）”或“镜像（Mirror）”或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经本平台授权的第三方工具、服务接入本平台和相关系统，或使用超文本标记语言元标记（Meta Tags）或代码或其他提及本平台及本平台提供之任何服务或网站的其他设备的信息，因任何目的，将任何人引导至任何其他网站；
        •	h.传输或张贴任何资料，只要它们构成或可能构成以下行为：可能被视为任何违法犯罪行动的、或引起民事责任，或违反中国或世界任何其他国家/地区的法律，或侵犯第三方权利；
        •	i.除了可适用法律所允许的范围内，修改、改编、再授权、转换、出售、逆向工程、译解、解码或以其他方式反汇编、反向编译本平台及本平台提供之任何拥有知识产权的内容与服务所使用的任何软件的任何部分，或使其他人这样做；
        •	·利用本平台的会员权限向他人推销“可代其向指定客户联系”的服务；
        •	强制、诱导其他用户关注、点击链接页面或分享信息的；
        •	虚构事实、隐瞒真相以误导、欺骗他人的；
        •	·将您的会员账号及密码交由其他人使用，包括但不限于转让、借用等；
        •	·以盈利或非盈利的目的，帮助他人传达交友及求爱信息或索取本平台会员联系方式；
        •	利用技术手段批量建立虚假账号的；
        •	·其他任何非以本人交友及求爱为目的所实施的行为。
        •	k.出售、泄露本平台会员信息；
        •	l. 利用账号向他人推销“可代其向指定客户联系”的服务，包括但不限于猎头、广告营销等行为；
        •	m. 通过修改或伪造本平台运行中的指令、数据，增加、删减、变动本平台的功能或运行效果，制作、发布与以上行为相关的方法、工具，或对此类方法、工具进行运营或传播，无论这些行为是否为商业目的：
        •	n. 通过非本平台开发、授权的第三方产品、插件、外挂、系统，登录或使用本平台产品及服务，或制作、发布、传播非本平台开发、授权的第三方产品、插件、外挂、系统；
        •	o. 其他违反法律、法规明文规定以及公共道德或者经我们单方面判断为不合适的行为。
        •	若用户有上述行为，平台有权负除不良信息和违法信息、封禁、注销用户账号并追究用户相应的法律责任：
        •	若用户行为侵害他人任何权利而导致任何第三人对本平台提出任何索赔或请求，用户应当赔偿本平台或其他合作伙伴的损失，包括但不限于律师费、交通费、公证费和合理的调查费用等；若用户行为构成犯罪的，本平台有权追究其刑事责任。
        •	3.10您有权就本平台的其他会员有酒托茶托、花篮诈骗、情感诈骗、资料虚假等问题时向我们进行举报，您承诺前述举报行为均真实准确，本平台在接到举报后会积极予以响应。但请您知悉，由于您在投诉其他用户有违法行为或违反本协议情形时您的投诉信息可能涉嫌侵犯被投诉人的姓名权、名誉权、隐私权或其它合法权益，您应当承担投诉所产生的全部的法律责任。如您有虚假或恶意投诉，您将受到本平台的严肃处理，并将可能承担刑事等法律责任。如果因您虚假或恶意投诉而导致我们遭受任何损失的，您应就我们遭受的该等损失承担全额赔偿责任。如果由此导致任何第三方对我们提出任何权利请求的，您应保证我们不承担该等权利请求（包括适当的时候发表声明进行澄清）。如果我们先行对第三方承担责任的，我们有权对您进行追偿，您有义务在收到我们的追偿通知时全额赔偿我们的损失。
        •	3.11本平台提供的服务中可能包括广告，用户同意在使用过程中显示本平台和第三方供应商、合作伙伴提供的广告。除法律法规明确规定外，用户应自行对依该广告信息进行的交易负责，对用户因依该广告信息进行的交易或前述广告商提供的内容而遭受的损失或损害，本平台不承担任何责任。
        •	3.12用户在本平台中或通过本平台所传送、发布的任何内容并不反映或代表，也不得被视为反映或代表本平台的观点、立场或政策，本平台对此不承担任何责任。
      </View>

      <View className='h2 margin-bottom-12'>•	4.用户个人隐私信息保护</View>
      <View className='p1 margin-bottom-24'>•	为了保证您获得及时、优质服务，在您注册或访问本平台，或使用本平台产品或服务，或参加任何形式的活动时，您同意我们收集并使用您必要提交的个人信息（法律法规、规章规范性文件（以下称“法律法规”）规定的需要填写的身份信息）。这些用户个人信息包括但不限于：（a）您自行提供的用户个人信息（如学历认证中填写的姓名、身份证号、学历，昵称、出生年月、性别、籍贯、行业、收入、照片、手机号码、微信号及电子邮件地址等联系方式个人信息，使用服务时其他方提供的共享信息等）；（b）本平台为提供服务而合法收集的用户必要个人信息（如使用服务时系统自动采集的设备或产品信息，浏览历史信息，服务器日志上的信息，通讯时间信息等技术信息，用户开启定位功能并使用服务时的地理位置信息、IP地址、在线、无线信息、信件资料等）。其中个人隐私信息是指涉及用户个人身份或个人隐私的信息，比如，用户真实姓名、身份证号、手机号码、手机设备识别码、IP地址、用户聊天记录。非个人隐私信息是指用户对本服务的操作状态以及使用习惯等明确且客观反映在本平台服务器端的基本记录信息、个人隐私信息范围外的其它普通信息，以及用户同意公开的上述隐私信息。本平台保证在取得用户书面同意的情况下收集、使用或公开用户的个人隐私信息，用户同意本平台无需获得用户的另行确认与授权即可收集、使用或公开用户的非个人隐私信息。本平台收集上述信息将用于：提供网站服务、改进网站内容，满足用户对某种产品、活动的需求、通知用户最新产品、活动信息或根据法律法规要求的用途。如您提交的信息不完整或不符合法律法规的规定，则您可能无法使用本服务或在使用本服务的过程中受到限制。
        •	尊重用户个人信息的私有性是本平台一以贯之的制度，我们将采取技术措施和其他必要措施，确保您的个人信息安全，防止在本服务中收集的用户个人信息泄露、毁损或丢失。在发生前述情形或者本平台发现存在发生前述情形的可能时，本平台将及时采取补救措施并告知用户，用户如发现存在前述情形亦需立即与本平台联系。
        •	您提供的上述个人信息将存储在我们的计算机上。本协议一经缔结则意味着您同意我们在您用户身份终止前，无需您事先同意即可无偿使用该等信息为您提供服务或您定制的其他相关服务，包括但不限于创建兴趣、偏好和浏览模式档案或开展任何其它活动。您同意我们对所有用户提交的信息进行有关编排处理后形成的数据库拥有完全的知识产权。
        •	为了保证向用户提供及时、优质的交友服务，本平台会向您提供微信号、电话、手机、电子邮箱拨打电话或发送短信及邮件（内容包括但不限于服务流程确认，其他用户希望与您联系、约见，活动信息和咨询、新服务或新产品的推介等、提示再次登录MatchUs平台等）。您注册为我们的用户即表示您已经明确并同意接听上述电话或收到短信、邮件；如您不想接听上述电话或收到短信、邮件，请您拨打客服电话或登录本平台注销您的注册账号。如您未注销您的账户，则视为您同意接听或接受本平台给您的电话、短信及邮件。
        •	您同意本平台可在以下事项中使用您的个人信息：（a）经用户明确同意让第三方共享资料：（b）只有透露用户的个人信息，才能向用户提供用户所要求的产品及服务；（c）为保护本平台、用户及社会公众的财产权利或人身权利：（d）在提供本服务过程中将用户个人信息用于平台内嘉宾推荐的展示，任何登录或注册本平台的用户均可查看到推荐嘉宾的信息以及来自他人转发、分享的嘉宾信息；（e）向用户及时发送重要通知，如产品更新、升级、产品验证本协议条款的变更;（f）内部进行审计、数据分析和研究等，以改进产品、服务和与用户之间的沟通;（g）依本协议约定，管理、审查用户信息及进行处理措施;（h）受到黑客攻击、电脑病毒入侵导致用户个人信息泄漏的;（i）“隐私政策”列出的各类情况;(j)网络同步服务;（k）提高用户的使用安全性并提供客户支持;(l)被搜索引擎在搜索结果中显示; (m)因用户使用本平台特定功能或因用户有潜在婚恋服务意愿，向代表我们提供产品或服务的合作单位或授权单位提供您的个人信息;（n）适用法律法规规定的其他事项。在上述事项下本平台将用户的个人信息提供给第三方不需要获得用户事先同意。如因此给用户造成任何损害，用户同意免除本平台的相应法律责任。除上述事项外，如未取得用户事先同意,本平台不会将用户个人隐私信息使用于任何其他用途。
        •	您在缔结本协议时已理解并同意，您在本平台上公开发布的个人信息，任何登陆到本平台的第三人均可查看。尊重并保护用户个人隐私是我们的一贯政策。所以，在未经用户授权时，本平台不会向任何第三方公开、编辑或透露您未在本平台上公开发布的个人信息及保存在本平台各项服务中的非公开信息。但是为了保证向您提供及时、优质的服务，我们在诚信与法律的基础上认为透露这些信息在某些情况下是合理且必要的： (a)您明确同意让第三方共享资料（包括但不限于个人隐私信息）；(b)只有透露您的个人信息，才能提供您所要求的产品和服务；(c)为保护本平台、用户及社会公众的财产权利或人身权利；(d) 根据法律法规规定或有权机关的指示提供用户的个人隐私信息；(e)“隐私政策”列出的各类情况；(f)执行软件验证服务；(g)执行软件升级服务；(h)网络同步服务；(i)提高用户的使用安全性并提供客户支持；(j)被搜索引擎在搜索结果中显示；(k)因用户使用本平台特定功能或因用户有潜在服务意愿，向代表我们提供产品或服务的合作单位或授权单位提供您的个人信息；(l) 任何由于黑客攻击、电脑病毒侵入及其他不可抗力事件导致用户个人隐私信息的泄露；(m)为实现使用目的，其他有必要的情况。（n）由于您将用户密码告知他人或与他人共享注册账户与密码，由此导致的任何个人信息的泄漏，或其他非因本平台原因导致的个人隐私信息的泄露；（o）用户与本平台及合作单位之间就用户个人隐私信息的使用公开达成约定，本平台因此向合作单位公开用户个人隐私信息；（p）用户个人信息已经经过处理无法识别特定个人且不能复原；
        •	为了改善本平台的技术和服务，向用户提供更好的服务体验，本平台或可会自行收集使用或向第三方提供用户的非个人隐私信息。
        •	本平台保证在合法、正当与必要的原则下收集、使用或者公开用户个人信息且不会收集与提供的服务无关的用户个人信息。
        •	在前述情况下我们将您的个人信息提供给第三方且不需要获得您事先同意。如因此给您造成任何损害，您同意免除我们的相应法律责任。
        •	如果您位于中华人民共和国（为本协议之目的，本协议中所指中华人民共和国或中国，仅包括中华人民共和国大陆地区，不包括香港特别行政区、澳门特别行政区和中国台湾地区）境外，请注意，您提供的信息将被发送到中华人民共和国相关监管部门。通过成为本平台的用户，您同意: (a) 将您的个人信息传输到中华人民共和国相关监管部门；(b) 在中华人民共和国境内使用；(c) 依据我们的“隐私政策”，在服务提供和操作中将您的个人信息传输给第三方。
      </View>

      <View className='h2 margin-bottom-12'>•	5.知识产权</View>
      <View className='p1 margin-bottom-24'>•	5.1 除本服务中涉及广告的知识产权由相应广告商享有外，我们对本平台所拥有之权利包括但不限于本平台及其许可方受中国法律与法规及世界范围内其他可适用的法律、法规或国际条约、国际惯例保护的任何资料（包括但不限于网页、文字、图片、音频、视频、图表等）、商标及其他知识产权和所有权。本平台在本服务中所涉及的“MatchUs"图形、文字或其组成，以及其他本平台标志及产品、服务名称(以下统称“本平台标识”)，其著作权或商标权归本平台所有。未经我们事先书面同意，用户不得将“MatchUs”平台标识以任何方式展示或使用或作其他任何处理，也不得向他人表明用户有权展示、使用、或其他有权处理本平台标识的行为。除另有特别声明外，本平台提供本服务时所依托产品的著作权、专利权及其他知识产权均归本平台所有。上述及其他任何本平台或相关广告商依法拥有的知识产权均受到法律保护，未经本平台或相关广告商书面许可，用户不得以任何形式进行使用或创造相关衍生作品。除法律法规已有规定或者用户已合法获得我们书面许可的情况外，您不得复制、修改、公布、传播、出售、转售、执行、转载、许可使用、创建衍生作品、转移显示、以非法手段获取或以任何其他方式处置任何我们拥有知识产权或所有权的任何信息。
        •	5.2 未经该类知识产权拥有者事先同意，您不能以任何方式张贴、散布或转载任何受保护的资料、商标或其他知识产权。 除上述规定外，如果用户相信您的作品在本平台上被以一种构成侵害知识产权的方式复制、转载或公布，请向我们提供包括但不限于以下全部信息：知识产权的所有人（含被授权人或所有人的代理人）的电子或实际签名；您声称受到侵犯的受保护作品之详细说明；您声称受侵犯资料在本平台上的具体位置说明；您的地址、电话号码和电子邮件地址等联系方式；有关您确信该复制、转载或公布行为未经知识产权所有者或其代理或法律批准的书面陈述；您确保以上信息的真实性、合法性，而且您是知识产权所有人或所有人的代理人的书面陈述，该书面陈述需您本人签字确认方被视为有效。
        •	5.3您一经成为本平台之用户或使用本平台，则表示您承认我们对本平台及本平台所收集、制作、发布之各类信息拥有完全知识产权或所有权，包括但不限于各类文档、图像、标志、数据库等，除非法律或本协议明确规定该等权利属于用户个人。
        •	5.4如用户将任何信息公布到本平台的任何公共区域，则表示您同意，同时您自动授予，并且您陈述并保证您有权授予本平台不可撤销的、永久的、非独占的、完全免费的、世界范围内的许可。在该等许可下，您同意本平台包括但不限于以使用、复制、执行、显示、传播方式宣传该内容，您也同意我们基于该内容创作衍生作品或将该内容整合到其他作品中且我们对该等衍生作品或整合作品拥有完全的知识产权；同时，在该等许可下，您已授予我们对上述许可的再许可权，即我们可以将您授予我们的许可转授给其他第三人，并且我们行使再许可权不需要再获得您的同意。
        •	5.5 任何个人或单位通过本平台提供服务的内容可能涉嫌侵犯权利人的知识产权或信息网络传播权及其他合法权益的，权利人应该及时向本平台提出书面权利通知投诉，并提供身份证明、权属证明及详细侵权情况证明等资料。本平台在收到上述法律文件后，将会尽快依法断开相关链接内容。本平台提供投诉通道: 505749407@qq.com。如您在投诉过程中未向本平台提供合法有效的证明材料，本平台有权不采取任何措施
      </View>

      <View className='h2 margin-bottom-12'>•	6.服务访问</View>
      <View className='p1 margin-bottom-24'>•	尽管本平台会竭力确保一天24小时都能正常使用，但我们不保证它将不会中断或没有任何错误。
        •	如果系统发生故障、进行维护或维修或其他导致本平台不能正常运营的原因，导致对本平台的访问暂时中止，我们可能无法事先通知您，您同意在此情况下对您造成任何的损失（如有）免除我们的赔偿责任。
      </View>

      <View className='h2 margin-bottom-12'>•	7.信息储存及限制</View>
      <View className='p1 margin-bottom-24'>•	我们不对用户在本平台所发布相关信息的删除或储存失败负责。我们有判定您的行为是否符合本协议的要求和精神的保留权利，如果您违背了本协议的约定，我们有中断对您提供网络服务的权利。本平台不对用户在本服务中相关数据的删除或储存失败负责。
        •	本平台可以根据实际情况自行決定用户在本服务中数据的最长储存期限，并在服务器上为其分配数据最大存储空间等。用户可根据自己的需要自行备份本服务中的相关数据。
        •	如用户停止使用本服务或本服务终止，本平台可以从服务器_上永久地删除用户的数据。本服务停止、终止后，本平台没有义务向用户返还任何数据
      </View>

      <View className='h2 margin-bottom-12'>•	8.豁免</View>
      <View className='p1 margin-bottom-24'>•	如果您因任何其他会员因使用本平台或其提供之服务引起的行为，向其要求索赔或进行诉讼，您同意独自进行该类索赔或诉讼，不会要求我们协助举证或者将我们列为被告或第三人，而且您将豁免我们承担由该索赔或诉讼引起的任何相关联的所有索赔、责任和损失。
        •	如果由于您使用本平台或其提供之服务的行为或其他相关行为，导致我们遭受索赔或诉讼，您同意就我们因此所受的全部损失进行赔偿，该等赔偿应包括但不限于我们在此索赔或者诉讼中支付的律师费及其他诉讼费用。您也同意在涉及上述任何索赔及诉讼时，尽其所能地给予配合与协助，以最大限度的降低我们的损失。
      </View>

      <View className='h2 margin-bottom-12'>•	9.法律责任</View>
      <View className='p1 margin-bottom-24'>•	9.1 违约责任。您同意，如果本平台发现或收到他人举报或投诉用户违反本协议约定的，且经我们单方面判断，您违反本协议的一项或多项条款，本平台有权不事先通知您而直接审查并屏蔽您的帐户、删除聊天记录与被禁内容并阻止发布您的部分或全部档案，并视情节轻重对违规账号处以包括但不限于警告、账号封禁、设备封禁、功能封禁、账号注销的处罚，且通知用户处理结果。我们也有权不事先通知您而直接永久或暂时阻止您使用部分或全部服务。对于您在此情况下受到的任何损失我们不承担任何责任且我们没有义务返还您已交纳的用户费用（无论全部或部分）。
        •	用户理解并同意，本平台有权依据合理判断对违反有关法律法规或本协议规定的行为进行处罚，对违法违规与本协议规定的任何用户采取适当的法律行动，并依据法律法规保存有关信息向有关部门报告等，用户应承担由此而产生的一切法律责任。
        •	9.2 赔偿责任。上述情况下，如果因用户对本协议任一项或多项条款的违反而导致本平台遭受任何损失的，您应就我们遭受的该等损失承担全额赔偿责任。如果由此导致任何第三方对本平台提出任何权利请求的，您应保证我们不承担该等权利请求（包括适当的时候发表声明进行澄清）。如果我们先行对第三方承担责任的，我们有权对您进行追偿，您有义务在收到我们的追偿通知时三天之内全额赔偿我们的损失。
        •	用户理解并同意，如果因为您通过本平台提供的服务提供、张贴、传送任何内容而导致违反本协议并进而造成我们损失时，您同意赔偿本平台因此遭受的损失，包括但不限于律师费和调查费等费用。
        •	用户理解并同意，如果因为您侵害第三人任何权利因而导致任何第三人向我们提出索赔或请求，您同意赔偿我们因此遭受的损失，包括但不限于律师费和调查费用等费用。用户应当赔偿本平台与合作公司、关联公司，并使之免受损害。
      </View>

      <View className='h2 margin-bottom-12'>•	10.本协议之生效、变更、中断及终止</View>
      <View className='p1 margin-bottom-24'>•	10.1用户理解并确认，一旦您开始使用本平台或者注册成为本平台的会员，则本协议立即生效。如果您选择使用本平台或者成为本平台的用户，表示您选择开始使用本平台提供之任何信息及服务并同时接受本协议所有条款之约束。
        •	10.2用户已同意，鉴于网络服务的特殊性，如您在使用本平台服务期间，存在任何违反法律法规法约、违反本协议规定或违背公序良俗、婚恋交友目的的行为，本平台有权采取包括但不限于以下措施：自行全权决定而不经事先通知的中止、终止向您提供部分或全部平台服务、暂时冻结或永久冻结(关闭)您的账号。您同意本平台无须为上述行为向您或任何第三方承担任何法律责任。
        •	10.3您可以随时终止您的用户身份，您的终止行为在我们收到您书面或电子邮件通知后立即生效。您可以通过以下方式与本平台联系：通过客服邮箱（505749407@qq.com）向我们发送电子邮件，也可以添加客服人员微信MatchUsZJU。
        •	于缔结本协议时，用户已知悉并同意，就前述单方面终止用户身份的行为，您并无任何权利要求，本平台亦无义务向您返还您已支付的任何费用（如有），但本平台将于收到您的书面或电子邮件通知并审查确认您的身份后撤销您在本平台上的相关信息。如您希望终止您的会员身份但未通过电子邮件方式通知我们，使得您在本平台上的相关信息未能及时撤销的，您无权以任何理由就此对我们主张任何权利。
        •	10.4如您违反本协议之任一条款，或发生下列任何一种情形，我们有权立即终止您的用户身份，及访问和使用本平台的权利。您同意在上述情况下本平台终止本协议并不需要通知您即可生效，对于您在此情况下受到的任何损失我们不承担任何责任且我们没有义务返还您已交纳的费用（无论全部或部分）。
        •	（1）根据法律规定用户应提交真实信息，而用户提供的个人资料不真实、或与注册时信息不一致又未能提供合理证明，
        •	（2）用户违反相关法律法规或本协议的约定；
        •	（3）按照法律规定或有权机关的要求；
        •	（4）出于安全的原因或其他必要的情形。
      </View>

      <View className='h2 margin-bottom-12'>•	11. 其他免责说明及不可抗力</View>
      <View className='p1 margin-bottom-24'>•	本平台依据本协议所述内容为用户提供服务，但您已理解并同意我们不保证所提供的服务将最终成功帮助您找到伴侣。您承认对于您利用本平台提供的服务或信息而从事的任何行为，包括在本平台上传或发布任何信息，利用本平台提供之信息联系其他用户等，均为您个人行为且您个人对该类行为承担完全责任。
        •	本协议不可抗力是指协议双方不能预见、不能避免并不能克服的客观情况，包括但不限于洪水、地震、台风、战争、骚乱、国家政策、国家公布的疫情等事件。鉴于互联网的特殊性，本平台提供的服务同大多数互联网服务一样，本协议所称“不可抗力”亦包括下列影响互联网正常运行的情形：计算机病毒侵袭、黑客攻击、电信部门技术调整导致的重大影响、因政府管制而造成平台的暂时关闭、停电、通信故障、用户原因、社会环境等。如他人利用用户的资料，对用户造成现实生活中的骚扰；用户下载安装的其它产品或访问的其他任何网站中含有“特洛伊木马“等病毒，威胁到用户的计算机信息和数据的安全，继而影响本服务的正常使用等等。用户同意并认可，对于因上述超出我们合理控制范围的任何事件或情况所给您造成的任何损失或损害，我们无需承担任何赔偿责任，并不被视为违反本协议。同时用户应加强信息安全及使用者资料的保护意识，要注重密码保护，以免遭致损失和骚扰。
        •	用户理解并确认，本平台提供的服务存在因不可抗力、计算机病毒或黑客攻击、系统不稳定、用户所在位置差异、用户关机以及其他任何技术、互联网络、通信线路原因等造成的平台服务中断或不能满足用户要求的险，因此导致的用户或第三方任何损失，本平台不承担任何责任。
        •	用户理解并确认，在使用本平台提供的服务过程中存在来自任何他人的包括误导性的、欺骗性的、诽谤性的、威胁性的、令人反感的或任何非法的信息，或侵犯他人权利的匿名或冒名的任何信息，以及任何伴随该等信息的行为，因此导致的用户或第三方的任何损失，本平台不承担任何责任。
        •	用户理解并确认，本平台需要定期或不定期地对本平台或相关的设备进行检修或者维护，如因任何此类情况而造成服务在合理时间内的中断，本平台无需为此承担任何责任，但本平台应事先面向用户进行通告。
        •	用户理解并确认，本平台依据法律法规、本协议约定获得处理违法、违规或违约内容的权利，但该权利不构成本平台的义务或承诺，本平台不能保证及时发现违法、违规或违约行为或及时进行相应理。
        •	用户理解并确认，对于本平台向用户提供的下列产品或者服务的质量缺陷及其引发的任何损失，本平台无需承担任何责任。
        •	（1）本平台向用户免费提供的服务；
        •	（2）本平台向用户赠送的任何产品或者服务。
        •	在任何情况下，本平台均不对任何偶然性、特殊性、间接性、后果性、惩罚性或刑罚性的损害，包括因用户使用本平台服务而遭受的利润损失，承担责任（即使本平台已被告知该等损失的可能性然）。尽管本协议中可能含有相悖的规定，本平台对用户承担的全部责任，无论因何原因或何种行为方式，始终不超过用户因使用本平台提供的服务而支付给本平台的费用（如有）。
      </View>

      <View className='h2 margin-bottom-12'>•	12.通知和送达</View>
      <View className='p1 margin-bottom-24'>•	本协议项下所有的通知均可通过重要页面公告、电子邮件、应用内部信息传送或常规的信件传送等方式进行，使用电子通信渠道传输的通知于发送之日即视为已送达收件人。</View>

      <View className='h2 margin-bottom-12'>•	13.争议及管辖</View>
      <View className='p1 margin-bottom-24'>•	13.1 用户争议的解决。您理解并同意本平台仅仅是为您和其他用户的交往提供平台，但对您与本平台用户的来往，无论是在应用上或在现实生活中，您都须对您的任何行为承担全部责任。如您与其他用户产生争议，则您理解并同意本平台并没有义务监控或处理您与其他用户之间的争议。
        •	13.2管辖。如果因使用本平台产生任何关于本平台或其提供之服务的争议，您同意该类争议将受中华人民共和国法律法规法约管辖，而不考虑可能产生的法律冲突。您同意，除非双方另行协商，该争议应交由杭州市有管辖权的人民法院进行诉讼，涉及费用包括但不限于诉讼费、执行费、交通费、律师费等均由败诉方承担。
      </View>

      <View className='h2'>•	14.其他</View>
      <View className='p1 margin-bottom-24'>•	14.1内容可分割性。如果本协议的任何部分被有权机关确定为无效或被协议双方认定为不可实施，那么协议的其余部分应该继续生效。就无效或不可实施之部分，本平台有权单方面进行修改，使之具备法律效力且可以实施。
        •	14.2.转让。本平台有权单方面转让或转移我们在本协议项下的全部或部分权利和义务而不需要提前通知用户。由于本平台提供服务有较强的人身性，您承诺放弃您转让本协议项下之权利和义务的权利。
        •	14.3 关系。用户理解并同意，您同意不会因为本协议或使用本平台，而代表着与本平台之间产生合资、合伙、雇佣或代理关系。
        •	14.4权利认定。本协议构成双方对本协议之约定事项及其他有关事宜的完整协议，除本协议规定的之外，未赋予本协议各方其他任何权利。
        •	14.5 联系信息。如在使用本平台服务过程中有任何疑问及需求请发送电子邮件至客服邮箱（505749407@qq.com）与我们联系。
        •	14.6本平台郑重提醒用户注意并审慎阅读理解本协议中免除本平台责任和限制用户权利的条款，请用户仔细阅读，并自主考虑其中风险。未成年人应在法定监护人的陪同下阅读本协议。
        •	14.7本协议的效力、解释及纠纷的解决，适用于中华人民共和国的任何现行法律。若用户和本平台之间发生任何纠纷或争议，首先应友好协商解决，协商不成的，用户同意将纠纷或争议提交杭州仲裁委员会，其仲裁裁决是终局的。本协议条款因与中华人民共和国现行法律相抵触而导致部分条款无效的，不影响其他条款的效力。
        •	14.8、由于互联网高速发展，您与本平台签署的本协议列明的条款可能并不能完整罗列并覆盖您与MatchUs所有权利与义务，现有的约定也不能保证完全符合未来发展的需求。因此，MatchUs隐私政策、MatchUs平台行为规范等均为本协议的补充协议，与本协议不可分割且具有同等法律效力。如您使用MatchUs平台服务，视为您同意上述补充协议。
        •	14.9请您在发现任何违反本服务协议以及其他任何单项服务的服务条款、MatchUs各类公告之情形时，通知MatchUs。您可以通过如下联络方式同MatchUs联系：联系邮箱：505749407@qq.com
        •	我已阅读并充分理解了以上协议中各条款，特别是涉及免除或者限制我们责任的免责条款，对用户的权利限制的条款、约定争议解决方式、司法管辖、法律适用的条款，并且同意以上协议的全部内容。
      </View>
    </View>
  )
}

export default Index
