import { View } from "@tarojs/components";
import './index.scss'

const Index = () => {

  return (
    <View className='container wrapper'>
      <View className='h1'>MatchUs个人信息保护策略</View>

      <View className='p1 margin-bottom-12'>MatchUs（以下简称“我们”）深知个人信息对您的重要性，并非常重视用户的隐私，会尽力保护您的个人信息安全可靠，我们致力于维持用户对我们的信任。您在使用我们的服务时，我们可能会收集和使用您的相关个人信息及用户信息（以下统称为“信息”）。但我们将恪守以下原则，保护您的个人信息：权责一致原则、确保安全原则、主体参与原则、公开透明原则目的明确原则、选择同意原则、最少够用原则、等等。同时本平台承诺，我们将按业界成熟的安全解决方案，采取相应的安全保护措施来保护您的个人信息。鉴于此，我们制定本《MatchUs隐私保护政策》（以下简称“本政策 /本隐私保护政策”） 向您说明，在使用本平台的服务时，我们如何收集、储存、使用和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。并提醒您：</View>
      <View className='p1 margin-bottom-12 bold'>您必须阅读、同意并遵守我们的《MatchUs用户协议》，才可以使用我们的产品及服务。在您同意《MatchUs用户协议》之时，您已经同意我们按照本隐私保护政策来使用和披露您的个人信息。本隐私保护政策的任何条款全部属于《MatchUs用户协议》的一部分。</View>
      <View className='p1 margin-bottom-12'>本政策适用于MatchUs产品或服务。若我们关联公司的产品或服务中使用了MatchUs提供的产品或服务（例如直接使用MatchUs账户登录）但未设独立隐私权政策的，则本政策同样适用于该部分产品或服务。</View>
      <View className='p1 margin-bottom-12'>需要特别说明的是，本政策不适用于其他第三方向您提供的服务，也不适用于MatchUs中已另行独立设置隐私权政策的产品或服务。</View>
      <View className='p1 margin-bottom-12 bold'>【特别提示】在使用MatchUs各项产品或服务前，请您务必仔细阅读并透彻理解本政策，重点内容我们已采用粗体的方式来表示，望您特别注意，在确认充分理解并同意后使用我们的相关产品或服务。如果您不同意本政策的内容，将可能导致本平台的产品和服务无法正常运行，或者无法达到我们拟达到的服务效果，您应立即停止访问/使用我们的产品与/或服务。一旦您开始使用或继续使用MatchUs各项产品或服务，即表示您已充分理解并同意本政策（包括更新版本）。如您对本政策内容或与本政策相关的事宜有任何疑问、意见或建议，您可通过MatchUs提供的各种联系方式与我们联系。</View>
      <View className='p1 margin-bottom-24'>本隐私权政策部分将帮助您了解以下内容：
        1、我们如何收集和使用您的个人信息
        2、我们如何使用 Cookie 和同类技术
        3、我们如何共享、转让、公开披露您的何种个人信息
        4、我们如何储存您的个人信息和保护您的个人信息安全
        5、您如何管理您的个人信息
        6、您的个人信息如何在全球范围转移
        7、本隐私权政策如何更新及通知
        8、如何联系我们
      </View>

      <View className='h2 margin-bottom-12'>一、我们如何收集和使用您的个人信息</View>
      <View className='p1 margin-bottom-24'>个人信息是指以电子或者其他任何方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息，我们会出于本政策所述的以下目的，获取和使用您的个人信息：
        我们收集用户的个人信息主要是为了您和其他用户能够提高使用MatchUs服务的便利程度与满意程度。MatchUs的目标是向所有的互联网用户提供安全、趣味及有意义的上网经历。而上述信息有助于我们实现这一目标。
        我们将通过以下途径收集和获得您的个人信息：
        1、您提供的信息。例如
        （1）您在注册MatchUs服务的账号或使用MatchUs服务时，提供的信息：
        （2）您通过MatchUs服务向其他方提供的共享信息，以及您使用MatchUs服务时所储存的信息。
        请注意，如您在MatchUs服务中其他用户可见的公开区域内上传或发布的任何信息中、您对其他人上传或发布的任何信息作出的回应中您的任何信息，该信息可能会被他人收集并加以再次使用。当您发现他人不正当收集或使用您的信息时，可通过本政策“如何联系我们”章节所列的反馈渠道联系我们。
        2、其他方分享的您的信息。即其他方使用MatchUs服务时所提供有关您的共享信息。
        3、我们获取的您的信息。您在使用MatchUs服务时，我们收集、汇总、记录的信息，例如日志信息、位置信息、设备信息。
        我们会出于以下目的，收集和使用您以下类型的个人信息
        （一）帮助您完成注册及登录而成为我们的用户

        为完成创建MatchUs账号，以便我们为您提供服务，依照相关法律法规法约的要求，您需要提供包括但不限于以下基本注册信息：您的身份证/社会保险信息/企业工牌、企业邮箱、出生年月日、性别、手机号码/微信号、居住地、身高、专业、学历、个人照片、一句话签名等等。您可选择微信号授权登录或者手机验证登录。如果您不提供微信号授权或者手机号码，我门将不能向您提供任何服务。

        在注册过程中，如果您提供以下额外信息补全个人资料，将有助于我们给您提供更好的服务和体验：自我介绍、对另一半的要求、个人标签、择偶信息等。但如果您不提供这些信息，将不会影响使用MatchUs产品或服务的基本功能。

        请注意，您在本网站上公开发布的任何个人信息，任何登陆到我们产品或使用我们产品的第三人均可全部或部分的查看，以提高您通过我们产品相亲成功的机会。您提供这些信息即表示您同意本平台不同程度地向我们产品的使用者披露。

        请注意，我们产品的任何用户（无论是否注册或登录）都可以访问、阅览和打印您所提供并公开发布在产品上全部或部分信息，对于他人使用您在我们产品上所提供的任何信息，我们不承担任何责任。

        请注意，我们产品的任何用户（无论是否注册）都可以访问、下载和打印您所提供的除真实姓名和个人联系方式、身份证、学位证、社会保险信息/企业工牌、企业邮箱以外的信息。对于他人使用或公开您在我们网站所提供的信息，我们不承担任何责任。

        同时，一旦您使用本平台产品或成为用户，则表示您已许可我们将这些信息披露给我们的附属公司、母公司和相关联的第三方商业机构，以及其他和我们处于共同公司控制权的有关联的法律实体和商业机构。但是，我们同样会要求上述这些法律实体和商业机构在使用和披露这些个人信息时遵守本隐私政策的相关条款。我们也可能会在法律规定或政府机关要求的情况下，即为了回应传票、许可证、法院命令、政府机关指令或其他法律程序，为免除您在生命、身体或财产方面之急迫危险，为防止他人权益之重大危害，提高用户的使用安全性并提供客户支持，及其他维护用户及MatchUs产品利益的情形下，去披露这些信息。

        您理解并同意，您所有相关的个人信息将会转移到计算机网络中进行维护，在符合当地法律规定的前提下，计算机网络可能位于您居住地以外的省/自治区/直辖市、国家/地区或其他政府管辖区域，在这些国家/地区可能没有像您所在的国家/地区那样对个人信息给予同等力度的法律保护。

        （二）为您展示和推送商品或服务
        本平台所收集和使用的个人信息是为您提供MatchUs服务的必要条件，如缺少相关信息，我们将无法为您提供MatchUs服务的核心内容，情况如下：
        （1）您在使用MatchUs交友服务时（包括但不限于编辑个人资料、与其他用户私聊、被推荐到其他用户推荐首页中等），要提供身份证信息进行实名认证，并且提供学历证明文件进行学历验证。若您选择不提供上述信息，不影响您享受MatchUs浏览服务，但无法使用上述交友服务；
        （2）您使用MatchUs交友服务时，我们会合法收集一些您额外的个人信息，以此为您提供更个性化更细致化的服务。额外的个人信息包括照片、呢称、身高、收入、所在校区、专业、个人动态、个人介绍。因MatchUs匹配的交友模式，您提供的额外个人信息会被其他用户查阅。若您选择不提供上述额外的个人信息，不影响您使用MatchUs的服务；
        （3）当用户上传学历图片、个人照片进行身份认证时，以及在与其他用户聊天过程中上传即时拍照图片或手机相册图片时，我们会申请您的相机权限，若您不同意，将无法享受上传即时拍照和手机相册图片的服务；为了方便用户上传图片，保存图片到手机，我们会申请修改/删除SD卡中的内容、读取SD卡上的内容权限；
        （4）为统计您的充值订单信息，我们会收集您在使用MatchUs服务过程中产生的充值订单信息便于您对账号上购买的增值服务进行管理：
        （5）当您想上传语音信息时，我们会申请您的录音权限，若您不同意，将无法上传语音信息：
        （6）当您与我们联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果；
        （7）为改善我们的产品或服务，向用户提供个性化的信息搜索及交易服务，了解产品适配性、识别账号异常状态，我们会在法律范围内，根据您的浏览及搜索记录、设备信息、位置信息、交易信息等，提取您的浏览、搜索偏好、行为习惯、位置信息等特征，基于特征标签进行间接人群画像并展示、推送合法信息。
        这些信息包括：
        日志信息：当您使用我们的客户端、微信小程序或微信公众号及微信web端提供的产品或服务时，我们会自动收集您对我们服务的详细使用情况，作为有关网络日志保存。例如您的搜索查询内容、Idiv地址、浏览器的类型、电信运营商、使用的语言、访问日期和时间及您访问的网页记录等。
        设备信息：我们可能会根据您在软件安装及使用中授予的具体权限，接收并记录您所使用的设备相关信息（包括国际移动设备身份码引MEI、网络设备硬件MAC地址、唯一设备标识符、广告标识符DFA、设备机型、设备分辨率、设备设置、客户端版本、操作系统及版本、应用包名、客户端版本、设备分辨率、设备设置、CPU信息、内存信息、电池使用情况）、设备所在位置相关信息（包括IP地址、GPS位置以及能够提供相关信息的WLAN接入点、蓝牙和基站传感器信息）。
        请注意，单独的设备信息、日志信息无法识别特定自然人身份的信息。如果本平台将这类非个人信息与其他信息结合用于识别特定自然人身份，或者将其与个人信息结合使用，则在结合使用期间，这类非个人信息将被视为个人信息，除取得您授权或法律法规另有规定外，我们会将该类个人信息做匿名化、去标识化处理。（8）如果您不想接受我们给您发送的商业广告，您可随时通过相应产品退订功能取消。
        （9）本平台通过间接方式收集到的您的个人信息我们可能从关联方、第三方合作伙伴等获取您授权共享的相关信息。包括但不限于我们可能从第三方获取您授权共享的账户信息（包括用户名、头像、昵称）并在您同意本政策后将您的第三方账户与您的MatchUs服务账户绑定，使您可以通过第三方账户直接登录并使用我们的产品与/或服务。我们将在符合相关法律法规法约规定下，并依据与关联方或第三方合作伙伴的约定、确信其提供的信息来源合法的前提下收集并使用您的这些信息。
        （10）您在注册账户或使用我们的服务时，向我们提供的相关个人信息，例如电话号码、电子邮件、支付宝账号等向MatchUs提供该其他方的前述个人信息之前，您需确保您已经取得其授权同意。
        （11）我们通过间接获得方式收集到的您的个人信息
        您可通过MatchUs账号在我们提供的链接入口使用我们关联公司提供的产品或服务，为便于我们基于关联账号共同向您提供一站式服务并便于您统一对信息进行管理，我们在MatchUs集中展示您的信息或推荐您感兴趣的信息。
        当您通过本平台产品或服务使用上述服务时，您授权本平台根据实际业务及合作需要从我们关联公司处接收、汇总、分析我们确认其来源的合法合规性或您授权同意其向我们提供的您的个人信息或交易信息。
        如您拒绝提供上述信息或拒绝授权，可能无法使用我们关联公司的相应产品或服务，或者无法展示相关信息，但不影响使用MatchUs核心服务。
        （12）基于上述您向本平台提供的信息、我们可能收集的信息及我们通过间接方式收集到的您的信息，我们可能会基于上述一项或几项信息的结合，进行推荐算法建模、程序化广告推荐算法建模、用户行为分析及用户画像，以便向您提供更契合您需求的页面展示和推荐个性化内容。
        当您与本平台联系时，我们可能会保存您的通信/通话记录和内容或您留下的联系方式等信息，以便与您联系或帮助您解决问题，或记录相关问题的处理方案及结果。

        （三）向您提供信息、商品或服务
        （1）向您发出通知。本平台可能在某些必需情况下（包括当我们由于系统维护而暂停某一单项服务、变更、中断、终止提供某一单项服务时）向您发出与服务有关的通知。
        （2）为您展示和推送商品或服务。我们可能使用您的信息（包括浏览及搜索记录、设备信息、位置信息、订单信息），用于提取您的浏览、搜索偏好、行为习惯、位置信息相关特征，并基于特征标签通过短信或其他方式向您发送营销信息，提供或推广我们或第三方的商品和服务。

        （四）为您提供安全保障

        用户理解并同意，为确保用户身份真实性、向您提供更好的安全保障，您可以向我们提供身份证、社保卡、学历证明、企业邮箱、企业工牌等身份信息完成实名认证。如您拒绝提供上述信息，可能无法使用账户管理、开通直播、继续可能存在风险的交易等服务，但不会影响您使用浏览、聊天等服务。
        为提高您使用本平台及我们关联公司、合作伙伴提供服务的安全性，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或MatchUs相关协议规则的情况，我们可能会收集、使用或整合您的用户信息、交易信息、设备信息、有关网络日志以及我们关联公司、合作伙伴取得您授权或依据法律共享的信息，来综合判断您账户及交易风险、进行身份验证、检测及防范安全事件，并依法采取必要的记录、审计、分析、处置措施。

        （五）改进我们的服务及其他
        本平台可能将通过某一项MatchUs服务所收集的信息，用于我们的其他服务。例如，在您使用某一项MatchUs服务时我们所收集的您的信息，可能在另一项MatchUs服务中用于向您提供特定内容或向您展示与您相关的，而非普遍推送的信息；我们可能让您参与有关MatchUs服务的调查，帮助我们改善现有服务或设计新服务：同时，我们可能将您的信息用于软件更新。
        用户理解并同意，本平台在收集您的个人信息后，可能通过技术手段对数据进行去标识化处理，去标识化处理的信息将无法识别您的身份，在此情况下我们有权使用已经去标识化的信息，对用户数据库进行分析并予以商业化的利用而无需另行获得您的同意。
        用户理解并同意， 如果我们要将您的个人信息用于本政策中未载明的其他用途或基于特定目的额外收集未提及的其他个人信息，我们会通过页面提示、交互流程、网站公告或其他方式另行征得您的同意。一旦您同意，该等额外用途将视为本政策的一部分，该等额外信息也将适用本政策。

        （六）征得授权同意的例外

        根据相关法律法规规定，以下情形中收集您的个人信息无需征得您的授权同意：

        1、与国家安全、国防安全有关的；

        2、与公共安全、公共卫生、重大公共利益有关的；

        3、与犯罪侦查、起诉、审判和判决执行等有关的；

        4、出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；

        5、所收集的个人信息是您自行向社会公众公开的；

        6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；

        7、根据您的要求签订合同所必需的；

        8、用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；

        9、为合法的新闻报道所必需的；

        10、学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；

        11、法律法规规定的其他情形。

        如我们停止运营MatchUs产品或服务，我们将及时停止继续收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您，对所持有的个人信息进行删除或匿名化处理。

        （七）反爬虫申明

        除非MatchUs另行声明，MatchUs内所有的用户资料（包括：昵称、个人基本信息、工作职业信息、自我介绍、相册图片等）的所有权利（包括肖像权、隐私权及其他相关权利）均归MatchUs及对应用户所有。未经平台或用户本人许可，任何人或机构不得以包括机器人、蜘蛛等程序或设备监视、复制、传播、展示、镜像等方式擅自使用平台内任何内容。
        （八）用户理解并同意，部分单项服务可能需要您在您的设备中开启特定的访问权限（包括您的位置信息、麦克风、相机和存储），以实现本平台对这些权限所涉及信息的收集和使用。当您需要关闭该功能时，大多数移动设备都会支持您的这项需求，具体方法请参考或联系您移动设备的服务商或生产商。请您注意，您开启任一权限即代表您授权我们可以收集和使用相关信息来为您提供对应服务，您一旦关闭任一权限即代表您取消了授权，我们将不再基于对应权限继续收集和使用相关信息，也无法为您提供该权限所对应的服务。但是，您关闭权限的决定不会影响此前基于您的授权所进行的信息收集及使用。
        （九）有关个人敏感信息的提示
        用户理解并确认，以上由您提供或本平台收集您的信息中，可能包含您的个人敏感信息（身份证件号码、通信记录和内容、财产信息行踪轨迹、交易信息）。请您谨慎并留意个人敏感信息，您同意您的个人敏感信息我们可以按本政策所述的目的和方式来处理。
      </View>

      <View className='h2 margin-bottom-12'>二、我们如何使用 Cookie 和同类技术</View>
      <View className='p1 margin-bottom-24'>我们或我们的第三方合作伙伴可能通过COOKIES或同类技术获取和使用您的信息，并将该等信息储存为日志信息。通过使用COOKIES，本平台向用户提供简单易行并富个性化的网络体验。一个COOKIES是少量的数据，它们从一个网络服务器送至您的浏览器并存在计算机硬盘上。本平台使用COOKIES是为了让您可以受益。比如，为使得MatchUs平台的登录过程更快捷，您可以选择把用户名存在一个COOKIES中。这样下次当您要登录MatchUs的服务时能更加方便快捷。COOKIES能帮助我们确定您连接的页面和内容，您在MatchUs特定服务上花费的时间和您所选择的MatchUs服务。
        （一）Cookie

        为确保网站正常运转、使您获得更轻松的访问体验、向您推荐您可能感兴趣且富有个性化的内容、更好、更快地为您服务，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。借助于 Cookie，网站能够存储您的偏好等数据。
        然而，您应该能够控制COOKIES是否以及怎样被您的浏览器接受。请查阅您的浏览器附带的文件以获得更多这方面的信息。
        我们和第三方合作伴可能通过COOKIES或同类技术收集和使用您的信息，并将该等信息储存。
        我们使用自己的COOKIES或同类技术，可能用于以下用途：
        （1）记住您的身份。例如：COOKIES或同类技术有助于我们辨认您作为我们的注册用户的身份，或保存您向我们提供包括但不限于有关您的喜好或其他信息：
        （2）分析您使用我们服务的情况。我们可利用COOKIES或同类技术来了解您使用MatchUs进行什么活动、或哪些服务最受欢迎：
        （3）广告优化。COOKIES或同类技术有助于我们根据您的信息，向您提供与您相关的广告而非进行普遍的广告投放我们为上述目的使用COOKIES或同类技术的同时，可能将通过COOKIES或同类技术收集的非个人身份信息汇总后，提供给广告商和其他伙伴，用于分析您和其他用户如何使用MatchUs服务并用于广告服务。（二）网站信标和像素标签
        除 Cookie 外，我们及广告商和其他合作方还会在网站上使用网站信标和像素标签等其他同类技术，这些技术可能会收集与您相关的非个人身份信息，以用于分析用户如何使用该等服务、向您发送您可能感兴趣的广告，或用于评估广告服务的效果。这些第三方COOKIES或同类技术收集和使用该等信息不受本政策约束，而是受到其自身的信息保护声明约束，我们不对第三方的COOKIES或同类技术承担责任。
        例如，本平台向您发送的电子邮件可能含有链接至我们网站内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。
        如果用户不希望自己的活动以这种方式被追踪，则可以随时从本平台的寄信名单中退订，即您可以通过浏览器或用户选择机制拒绝或管理COOKIES或同类技术。但请您注意，如果您停用COOKIES或同类技术，我们有可能无法为您提供最佳的服务体验，某些服务也可能无法正常使用。同时，您仍然将收到广告，只是这些广告与您的相关性会降低
      </View>

      <View className='h2 margin-bottom-12'>三、我们如何共享、转让、公开披露您的何种个人信息</View>
      <View className='p1 margin-bottom-24'>（一）共享

        除以下情况除外，我们不会与MatchUs服务提供者以外的公司、组织和个人等任何第三方共享您的个人信息，：

        1、在获取明确同意（如向您提供本平台服务）的情况下共享：获得您的明确同意后， 向您提供我们的服务。本平台可能向合作伙伴及其他第三方分享您的信息，以实现我们产品与/或服务的功能，让您正常使用您需要的服务，例如：提供支付服务的支付机构、提供数据服务（包括网络广告监测、数据统计、数据分析）的合作伙伴、提供广告服务的合作伙伴和其他服务提供商；

        2、在法律法规法约允许范围内的共享：我们可能会根据法律法规法约规定、诉讼争议解决需要，或按行政、司法机关依法提出的要求，维护我们及我们的关联方或合作伙伴、您或其他用户或社会公众利益、财产或安全免遭损害，比如为防止欺诈等违法活动和减少信用风险，本平台可能与其他公司和组织等第三方交换信息。不过，这并不包括违反本政策中所作的承诺而为获利目的出售、出租、共享或以其它方式披露的信息。

        3、与关联方间的必要共享：为便于我们基于统一的关联账号共同向您提供一致化服务以及便于您进行统一管理、个性化推荐、保障系统和账号安全等，您的个人信息可能会在我们和我们的关联方之间进行必要共享。我们只会共享必要的个人信息（如为便于您使用MatchUs账号使用我们关联公司产品或服务，我们会向关联公司共享您必要的账户信息），如果我们共享您的个人敏感信息或关联公司改变个人信息的使用及处理目的，将再次征求您的授权同意。
        4、与授权合作伙伴及委托我们进行推广的合作伙伴等第三方共享：仅为实现本隐私权政策中声明的目的，使该等委托方了解推广的覆盖面和有效性，本平台的某些服务将由我们和授权合作伙伴共同提供。本平台可能会与授权合作伙伴共享您的某些个人信息，以提供更好的客户服务和用户体验。例如告知该委托方有多少人看了他们的推广信息或在看到这些信息后购买了委托方的商品，或者向他们提供不能识别个人身份的统计信息，帮助他们了解其受众或顾客，安排合作伙伴提供服务。
        5. 实现本政策第一条“我们如何收集和使用个人信息”部分所述目的。
        6. 履行我们在本政策或我们与您达成的其他协议中的义务和行使我们的权利。
        7、应您合法需求或经您的授权同意。
        8、应您的监护人合法要求而提供您的信息。
        9、根据与您签署的单项服务协议（包括在线签署的电子协议以及相应的平台规则）或其他的法律文件约定所提供。
        10、基于学术研究而提供；
        11、基于符合法律法规的社会公共利益而提供。
        我们仅会出于合法、合理、正当、必要、特定、明确的目的共享您的个人信息，并且只会共享提供服务所必要的个人信息。我们的合作伙伴无权将共享的个人信息用于与产品或服务无关的其他用途。对本平台与之共享个人信息的公司、组织和个人，我们会与其签署严格的数据保护协定，要求他们按照我们的说明、本隐私权政策以及其他任何相关的保密和安全措施来处理个人信息。

        （二）转让

        本平台不会将您的个人信息转让给任何公司、组织和个人，但以下情况除外：

        1、在获取用户明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的个人信息；

        2、随着我们业务的持续发展，在涉及合并、收购或破产清算情形，或其他涉及合并、收购、资产转让或破产清算情形时，如涉及到个人信息转让（您的信息有可能作为此类交易的一部分而被转移），我们会要求新的持有您个人信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。

        （三）公开披露

        我们仅会在以下情况下，且采取符合业界标准的安全防护措施的前提下，公才开披露您的个人信息：

        1、获得您明确同意或基于您的主动选择，我们可能会公开披露您所指定的个人信息；

        2、根据法律、法规、法约的要求、强制性的行政执法或司法要求所必须提供您信息的情况下，如果我们确定您出现违反法律法规或严重违反MatchUs相关协议规则的情况，或为保护MatchUs及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据法律法规或MatchUs相关协议规则披露关于您的特定个人信息，包括相关违规行为以及MatchUs已对您采取的措施。在符合法律法规的前提下，当本平台收到上述披露信息的请求时，我们会要求接收方必须出具与之相应的法律文件，如传票或调查函。我们坚信，对于要求我们提供的信息，应该在法律允许的范围内尽可能保持合理透明。
        本平台对所有的请求都进行了高度慎重审查，以确保其具备合法依据，且仅限于执法部门因特定调查目的且有合法权利获取的数据。
        （四）共享、转让、公开披露个人信息时事先征得授权同意的例外

        以下情形中，共享、转让、公开披露您的个人信息无需事先征得您的授权同意：

        1、与国家安全、国防安全有关的；

        2、与公共安全、公共卫生、重大公共利益有关的；

        3、与犯罪侦查、起诉、审判和判决执行等有关的；

        4、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；

        5、您自行向社会公众公开的个人信息；

        6、从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。

        根据法律规定，共享、转让、公开披露经去标识化处理的个人信息，且确保数据接收方无法复原并重新识别个人信息主体的，不属于个人信息的对外共享、转让及公开披露行为，对此类数据的保存及处理将无需另行向您通知并征得您的同意。
        7、为实现使用目的，其他有必要的情况及法律法规规定的其他情形。
      </View>

      <View className='h2 margin-bottom-12'>四、我们如何储存您的个人信息和保护您的个人信息安全</View>
      <View className='p1 margin-bottom-24'>我们仅根据本政策所述目的所必需期间和法律法规要求的最短时限储存您的个人信息。但在下列情况下，我们可能因需符合法律要求，更改个人信息的存储时间：
        1、为遵守适用的法律法规规定，例如，《中华人民共和国网络安全法》第二十条第三款要求监测、记录网络运行状态、网络安全事件的技术措施的网络日志留存不得少于六个月：
        2、为遵守法院判决、裁定或其他法律程序的规定：3、为遵守政府机关或法定授权组织的要求。
        如我们中断、终止服务或运营，我们将及时停止继续收集您个人信息的活动，同时会遵守相关法律法规要求提前向您通知，并在中断、终止服务或运营后对您的个人信息进行删除或匿名化处理，但法律法规或监管部门另有规定的除外。本平台在中华人民共和国境内运营中收集和产生的个人信息，储存在中国境内，以下情形除外：
        1、法律法规有明确规定
        2、获得您的授权同意：
        3、您使用的产品、服务涉及跨境，MatchUs需要向境外提供您的个人信息的。
        针对以上情形，我们会确保依据本政策及国家法律法规要求对您的个人信息提供足够的保护。本平台非常重视信息安全，成立了专门的安全团队，并采取切合理可行的措施，保护您的个人信息：
        （一）数据安全技术措施 本平台会合理采用符合业界标准的合理可行的安全防护措施及通用解决方案，包括建立合理的制度规范、安全技术来防止您的个人信息遭到未经授权的访问、公开披露、使用、修改，避免数据的损坏或丢失。本平台的服务采取了多种加密技术，例如在某些产品中，我们将利用加密技术（例如SSL）来保护您的个人信息，采取加密技术对您的个人信息进行加密保存，并通过隔离技术进行隔离。
        在个人信息使用时，例如信息展示、信息关联计算，本平台会采用多种数据脱敏技术增强信息在使用中的安全性。我们还会采用严格的数据访问权限控制和多重身份认证技术保护个人信息，避免数据被违规使用。

        （二）数据安全管理体系 本平台有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术等多方面多维度提升整个系统的安全性。

        （三）我们为保护个人信息采取的其他安全措施 本平台通过建立数据分类分级制度、数据安全管理规范、数据安全开发规范等条例来管理规范个人信息的存储和使用，并通过信息接触者保密协议、监控和审计机制来对数据进行全面安全控制。本平台还会定期举办个人信息保护培训课程，加强员工的安全意识，提升对于保护信息重要性的认识。本平台会尽力避免收集无关的个人信息。我们只会在达成本政策所述目的所需的期限内保留您的个人信息，除非需要延长保留期或受到法律的允许。
        （四）我们仅允许有必要知晓这些信息的MatchUs员工、合作伙伴等第三方访问您的个人信息，并为此设置了严格的访问权限控制和监控机制。我们同时要求可能接触到您的个人信息的所有人员履行相应的保密义务。如果未能履行这些义务，可能会被追究法律责任或被中止与MatchUs的合作关系。
        （五）我们会采取一切合理可行的措施，确保未收集无关的个人信息。

        （六）互联网并非绝对安全的环境。电子邮件、即时通讯、社交软件或其他服务软件等与其他用户的交流方式无法确定是否完全加密，因此本平台建议您使用此类工具时请使用复杂密码，并注意保护您的信息安全。此外，我们强烈建议您不要使用非MatchUs推荐的通信方式发送个人信息。用户间可以通过我们的服务建立联系和相互分享。当您通过我们的服务创建交流、交易或分享时，您拥有自主选择沟通、交易或分享的对象，作为能够看到您的交易内容、联络方式、交流信息或分享内容等相关信息的第三方的权利。
        （七）本平台将尽力确保或担保您发送给我们的个人信息的安全性。如果我们的物理、技术或管理防护设施遭到破坏，导致个人信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。
        （八）安全事件处置 为应对个人信息泄露、损毁和损失等可能出现的风险，本平台严格制定了信息安全相关管理制度，明确安全事件、安全漏洞的分类分级标准及相应的处理流程。我们也为安全事件建立了专门的应急响应团队，按照安全事件处置规范要求，针对不同安全事件启动安全预案，进行止损、分析、定位、制定补救措施、及时联合相关部门针对特定事件进行溯源和打击。在不幸发生信息安全事件后，我们将按照法律法规的要求，第一时间向您告知安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们同时将及时通过网站公告、推送通知、弹窗提示、短信、电话或其他方式将事件相关情况以告知您，难以逐一告知信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，主动上报信息安全事件的处置情况。
        请您理解，由于技术的限制以及风险防范的局限，即便本平台已经尽量加强安全措施，也无法始终保证信息百分之百的安全。您需要了解，您接入MatchUs服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。请您务必妥善保管好您的账号、密码及其他身份要素。您在使用MatchUs服务时，我们会通过您的账号、密码及其他身份要素来识别您的身份。一旦您泄露了前述信息，您可能会蒙受损失，并可能对您产生不利。如您发现账号、密码及/或其他身份要素很有可能或已经泄露时，请您在第一时间和我们取得联系，以便我们及时根据您的申请采取相应措施以避免或降低相关损失。

        请注意，您在使用本平台服务时自愿共享甚至公开分享的信息，可能会涉及您或他人的个人信息甚至个人敏感信息，如您在发表动态或者在日记、话题等公众场合选择上传包含个人信息的图片。请您更加谨慎地考虑，是否在使用我们的服务时共享甚至公开分享相关信息。

        用户理解并确认，使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。

        同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。

        但是，用户理解并同意，无论采取何种严密措施，都难免发生信息泄漏的情况，就此类情况的发生，您同意免除我们相应的法律责任。
      </View>

      <View className='h2 margin-bottom-12'>五、您如何管理您的个人信息</View>
      <View className='p1 margin-bottom-24'>本平台鼓励您访问、更新和修改您的个人信息以使其更准确有效。您能通过MatchUs服务访问您的个人信息，并根据对应信息的管理方式自行完成或要求本平台进行修改、补充和删除。我们将采取适当的技术手段或提供提交申请的联系渠道，尽可能保证您可以访问、更新和更正自己的个人信息或使用MatchUs服务时提供的其他信息。
        在访问、更新、更正和删除前述信息时，本平台出于保障信息安全的考虑，可能会要求您进行身份验证。对于通过COOKIES或同类技术收集的您的信息，我们还在本政策第二条“我们如何使用COOKIES或同类技术"部分说明了向您提供的选择机制。如您想访问、更新或删除您的部分信息，请登录账号或联系客服进行操作。
        您可以通过以下方式访问及管理您的个人信息：

        （一）访问您的个人信息

        您有权访问您的个人信息，法律法规规定的例外情况除外。您可以通过以下方式自行访问您的个人信息：

        账号信息 ——如果您希望访问或更新编辑您的账户中的个人证件信息，手机绑定、支付信息、更改您的密码、添加安全信息或关闭您的账户等，您可以通过登录账号点击我的-设置执行此类操作。

        日记信息 ——用户可以登录账号“我的”访问或清除您的日记发表历史记录。 如果您无法通过上述路径访问该等个人信息，您可以随时通过MatchUs客服与我们取得联系。我们将在30天内回复您的访问请求。 对于您在使用我们的产品或服务过程中产生的其他个人信息，我们将根据本条“（七）响应您的上述请求”中的相关安排向您提供。

        个人资料 ——如果您希望访问或编辑您个人资料中的昵称、头像、家乡、出生年月日、星座、专业、兴趣爱好以及地点足迹其他资料等，您可以通过登录编辑个人主页执行此类操作。

        （二）更新或补充您的个人信息

        当用户发现本平台处理的关于您的个人信息有错误时，您有权要求我们作出更正或补充。您可以通过本条“（一）访问您的个人信息”中列明的方式提出更正或补充申请。

        （三）删除您的个人信息

        您可以通过本条“（一）访问您的个人信息”中列明的方式删除您的部分个人信息。
        在您申请账号注销时，本平台可能会要求您进行身份验证，以保障帐号的安全。我们将在收到您的账号注销申请后15天内完成注销处理，如果您在15天内继续使用MatchUs账号并销申请，我们可恢复您的账号信息。否则，您的账号将被正式注销，即对您的个人信息进行删除或匿名化处理，使其保持不可被检索、访问、查看的状态。
        用户理解并确认，由于技术所限、法律或监管要求，我们可能无法满足您的所有要求，我们会在合理的期限内答复您的请求。除法律法规法约另有规定，当您更正、删除您的个人信息或申请注销账号时，我们可能不会立即从备份系统中更正或删除相应的信息，但会在备份更新时更正或删除这些信息。
        在以下情形中，您可以向我们提出删除个人信息的请求：

        1、如果本平台处理个人信息的行为违反法律法规；

        2、如果本平台收集、使用您的个人信息，却未征得您的明确同意；

        3、如果本平台处理您的个人信息的行为严重违反了与您的约定；

        4、如果您不再使用本平台的产品或服务，或您主动注销了账号；

        5、如果本平台永久不再为您提供产品或服务。

        若本平台决定响应您的删除请求，我们还将同时尽可能通知从我们处获得您的个人信息的主体，要求其及时删除，除非法律法规另有规定，或这些主体获得您的独立授权。

        （四）改变您授权同意的范围

        本平台涉及的每个业务功能都需要一些基本的个人信息才能得以完成（见本隐私权政策“第一条”）。除此之外，本平台对于额外个人信息的收集和使用，您可以与本平台联系给予或收回您的授权同意。您始终可以选择是否披露信息。有些信息是使用MatchUs所必需的，但大多数其他信息的提供是由您决定的。您可以通过删除信息、关闭设备功能等方式改变您授权我们继续收集信息的范围或撤回您的授权。
        当您收回同意后，我们将不再处理相应的个人信息，也无法继续为您提供回授权所对应的服务。但您收回同意授权的决定，不会影响此前基于您的授权而开展的个人信息处理。

        （五）注销账户

        用途规划可以自行在“注销账户”页面提交账户注销申请，或者联系客服（微信：MatchUsZJU）删除。

        用户您主动注销账户之后，我们将停止为您提供产品或服务，根据适用法律的要求删除您的个人信息，或使其匿名化处理。

        （六）公开、分享及约束信息系统自动决策
        本平台的多项服务可让您不仅与您的社交网络，也与使用该服务的所有用户公开分享您的相关信息，例如，您在MatchUs服务中所上传或发布的任何信息，您对其他人上传或发布的信息作出的任何回应，通过在MatchUs服务中不特定用户可见的公开区域内上传或公布您的任何信息，以及包括与这些信息有关的任何位置数据和日志信息。只要您不删除您所公开或共享的信息，有关信息可能一直留存在公众领域；即使您除共享信息，有关信息仍可能由其他用户或不受我们控制的第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。如您将信息通过上述渠道公开或共享，由此造成您的信息泄露，我们不承担责任。因此，我们提醒并请您慎重考虑是否通过上述渠道公开或共享您的信息。
        在某些业务功能中，本平台可能仅依据信息系统、算法等在内的非人工自动决策机制做出决定。如果这些决定显著影响您的合法权益，您有权要求我们做出解释，我们也将在不侵害MatchUs商业机密或其他用户权益、社会公共利益的前提下提供申诉方法。
        （七）投诉举报
        投您可以按照本平台公示的制度进行投诉或举报。如果您认为您的个人信息权利可能受到侵害，或者发现侵害个人信息权利的线索，您可以在【我的】-【帮助与反馈】-【人工客服】，进入用户反馈界面。我们核查后会在15日内反馈您的投诉与举报。
        （八）访问隐私政策
        您可以在个人帐号【我的】-【设置】-【隐私协议】。
        查看本隐私政策的全部内容。
        （九）停止运营
        向您告知如本平台停止运营，我们将及时停止收集您个人信息的活动，将停止运营的通知以逐一送达或公告的形式通知您并对所持有的您的个人信息进行删除或匿名化处理。
        （十）响应您的上述请求

        为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。

        我们将在30天内作出答复。如您不满意，还可以发起投诉。

        对于您合理的请求，我们原则上不收取费用，但对多次重复、超出合理限度的请求，我们将视情收取一定成本费用。对于那些无端重复、需要过多技术手段（例如，需要开发新系统或从根本上改变现行惯例）、给他人合法权益带来风险或者非常不切实际的请求，我们可能会予以拒绝，您不可因此向我们主张任何责任。

        在以下情形中，按照法律法规要求，我们将无法响应您的请求：

        1、与国家安全、国防安全有关的；

        2、与公共安全、公共卫生、重大公共利益有关的；

        3、与犯罪侦查、起诉、审判和执行判决等有关的；

        4、有充分证据表明个人信息主体存在主观恶意或滥用权利的；

        5、响应您的请求将导致您或其他个人、组织的合法权益受到严重损害的；

        6、涉及商业秘密的；

        7、法律法规规定的其他情形；
      </View>

      <View className='h2 margin-bottom-12'>六、您的个人信息如何在全球范围转移</View>
      <View className='p1 margin-bottom-24'>我们在中华人民共和国境内运营中收集和产生的个人信息，存储在中国境内，以下情形除外：
        1、法律法规有明确规定；

        2、获得您的明确授权；

        3、您通过互联网进行跨境直播/发布动态等个人主动行为。

        针对以上情形，我们会确保依据本隐私权政策对您的个人信息提供足够的保护。
      </View>

      <View className='h2 margin-bottom-12'>七、本隐私权政策如何更新</View>
      <View className='p1 margin-bottom-24'>为了提供更好地服务，我们的隐私权政策可能根据产品或服务的更新情况及法律法规法约的相关要求进行适当变更。该等修改构成本政策的一部分。如该等更新造成您在本政策下权利的实质减少或重大变更，我们将在本政策生效前通过网站公告、推送通知、弹窗提示或其他方式来通知您，以便您及时了解本隐私政策的最新版本。
        我们的任何修改都会将用户的满意度置于首位。我们鼓励您在每次使用MatchUs服务时都查阅我们的隐私政策。我们可能在必需时（例如当我们由于系统维护而暂停某项服务时）发出与服务有关的公告。您可能无法取消这些与服务有关、性质不属于推广的公告。

        未经您明确同意，我们不会限制您按照本隐私权政策所应享有的权利。对于重大变更，我们会提供显著且明确的通知（包括但不限于我们会通过公示的方式进行通知甚至向您提供弹窗提示）。

        本政策所指的重大变更包括但不限于：

        1、本平台的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；

        2、本平台在控制权等方面发生重大变化。如并购重组等引起的所有者变更等；

        3、个人信息共享、转让或公开披露的主要对象发生变化；

        4、您参与个人信息处理方面的权利及其行使方式发生重大变化；

        5、本平台负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；

        6、个人信息安全影响评估报告表明存在高风险时。

        我们还会将本隐私权政策的旧版本存档，供您查阅。
      </View>

      <View className='h2 margin-bottom-12'>八、免责条款</View>
      <View className='p1 margin-bottom-24'>1、于缔结本协议时，您已同意就下列事由免除我们的法律责任：
        我们会依据本协议为您提供服务，但您已理解并同意本平台不保证其提供的服务一定能满足用户及会员的要求和期望，也不保证服务不会中断，对服务的及时性、安全性、准确性都不作保证。
        您承认对于您利用我们提供的服务或信息而从事的各类行为，包括在本平台发布各类信息，利用本平台提供之信息联系其他会员等，均为您个人行为且您个人对该类行为承担完全责任。
        对于用户通过本平台传送的照片、资料、证件等信息，本平台已采用相关措施并已采取合理措施按照国家有关规定进行严格审核，但不保证其内容的正确性、真实性、合法性、完整性。因此您在使用本平台时，可能会接触到令人不快、不适当或令人厌恶等违背公序良俗的内容。您同意在任何情况下，本平台均不为用户经由本平台以展示、发送电子邮件、微信或其它方式上传的任何内容负责。相关责任由上传上述内容的用户负责。对于上传的信息，其它用户应以自己的独立判断来确定上传的照片等信息的真实性、准确性，并独立承担可能产生的不利后果和责任，本平台对此不承担任何法律责任。
        对于在本平台上提供的各种广告信息、链接、资讯等（如有），我们已采用相关措施并已采取合理措施进行审核，但基于前述行为完全属于您和广告主、广告经营者之间的行为，与我们没有任何关系，我们并不就您经由我们所提供之信息与前述广告主、广告经营者进行的联系或进行的商业往来做出任何承诺及保证，。对于前述商业往来所产生的任何损害或损失，我们平台不承担任何责任。但本平台有权依法采取相应行动并停止传输任何前述内容，包括但不限于暂停用户使用本平台服务的全部或部分，保存有关记录，并根据国家法律法规、相关政策，在必要时向有关机关报告，同时配合有关机关的行动。
        是否使用本平台服务浏览、下载或取得任何资料应由用户自行考虑并自负风险，您同意因任何资料的下载而导致您电脑系统的任何损坏或数据丢失等后果，本平台不承担任何责任。
        本平台对于用户自发组织的任何活动，或自发成立的组织的任何行为以及其他任何非本平台组织的活动，不负任何责任。
        用户以自己的独立判断进行与交友相关的行为，并独立承担可能产生的不利后果和责任，本平台不承担任何法律责任。如果用户发现任何人违反本协议约定或以其他不当的方式使用本服务，请立即在本平台内举报或投诉该用户或联系客服处理，本平台将依本协议约定进行处理。
        对于本平台策划、发起、组织或是承办的任何活动（包括但不限于收费以及完全公益的活动），本平台不向用户作出任何关于上述活动的效果的保证或承诺，也不保证活动期间用户自身行为的合法性、合理性。由此产生的任何对于用户个人或者他人的人身或者是名誉以及其他损害，本平台不承担任何责任。
        2、责任限制。本平台和本平台运营商或与我们关联的企业，对于用户或任何第三人因以任何方式连接本平台或因使用、无法使用或使用本平台的结果可能导致的任何金钱或其他损失或损害不承担任何责任（该等损失或损害包括但不限于：任何直接的、间接的、惩罚性或必然的伤害或损失，或任何收入、利润、信誉、数据、合同、资金使用上的任何损失，或以任何方式由任何种类的业务中断引起或与之相关的损失或伤害，无论是民事侵权行为、刑事侵权行为、合同行为还是其他行为）。
        3、用户因电信部门等第三方的通讯线路故障、技术问题、网络、电脑故障、系统不稳定性及其他各种不可抗力原因而遭受的一切损失，我们以及我们的合作单位不承担责任。
        4、本服务同大多数互联网服务一样，受包括但不限于用户原因、网络服务质量、社会环境等因素的差异影响，可能受到各种安全问题的侵扰。会员应加强信息安全及使用者资料的保护意识，要注意加强密码保护，以免遭致损失和骚扰。
        5、对于会员的投诉，本平台将尽合理努力认真核实，但不能保证最终被公之于众的投诉处理结果完全公正，您同意，对于投诉内容和投诉处理结果，有侵犯您的隐私权、名誉权等合法权利的，免除本平台的相应法律责任，所有责任由投诉者承担。
        6、在任何情况下，本平台运营商均不对任何间接性、后果性、惩罚性、偶然性、特殊性或刑罚性的损害（包括因用户使用服务而遭受的利润损失、利益损失）承担责任（即使我们已被告知该等损失的可能性亦然）。尽管本协议中可能含有相悖的规定我们对用户承担的全部责任，无论因何原因或何种行为方式，始终不超过用户在使用本平台服务而支付给本平台运营商的服务费用(如有) 。
        7、对于您购买本平台服务，需要上门送货和收款的由于本平台快递服务提供商造成的延误，本平台不承担责任。
        8、本平台未授权任何第三方，销售任何MatchUs的线上服务产品，包括会员等。任何第三方出售本平台上述线上服务产品的，均可能属于非法的销售行为，本平台均无法保证提供相应的服务。
        9、您已理解并同意，因本平台业务发展需要，我们保留单方面对本服务的全部或部分服务内容变更、暂停、终止或销的权利，您承担此风险。
      </View>

      <View className='h2 margin-bottom-12'>九、如何联系我们</View>
      <View className='p1 margin-bottom-24'>1、如对本政策内容有任何疑问、意见或建议，您可通过MatchUs客服（微信号：MatchUsZJU）与我们联系；

        2、如发现个人信息可能被泄露，您可以通过发送邮件至（505749407@qq.com）投诉举报；

        如果您对我们的回复不满意，特别是您认为我们的个人信息处理行为损害了您的合法权益，您还可以通过向被告住所地有管辖权的法院提起诉讼来寻求解决方案。
      </View>
    </View>
  )
}

export default Index;
